# Section 6: Python for Data Analysis - Pandas

# 03 - DataFrames Part II

In [2]:
##In this video -> Conditional selection and multi-indexing data Frames 
import numpy as np 
import pandas as pd 

from numpy.random import randn 

np.random.seed(101)
df = pd.DataFrame(randn(5,4), ['A', 'B','C','D','E'], ['W','X','Y','Z'])

In [3]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [4]:
## Conditional Selection using bracket notation 

## Declaring a conditional operation in a dataFrame returns a dataFrame with Boolean values e.g. 

df > 0 ##Returns True or False depending on conditional operation

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [5]:
bool_df = df>0 
bool_df

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [8]:
df[bool_df] ## We obtain NAN or nulls in the elements where the condition returns false
            ## This operation is not that common - We most likely will pass a row or column value to obtain
            ## a subset of the dataFrame where the condition is True

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [9]:
df['W']>0 ## We obtain a boolean Series value so now 
          ## we can filter out rows based off of a column's value.

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [11]:
##Then 
df[df['W']>0] ## Returns only the rows where df['W']>0 
              ## Now, since we are passing a Series we don't get null values anymore. -> More common conditional 
              ## selection in the course
              ## We only obtain null values when we pass entire boolean data Frames.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
## Grabbing all the rows in our dataFrame where df['W'] > 0
## Now, 

df[df['W'] > 0] ##Returns a dataFrame and thus we can call methods or select data on this resulting df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
##Consider 
df[df['W']>0][['Z','X']] ##This can be done in multiple steps of course, however, one must consider the memory  usage.

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
D  0.955057 -0.758872
E  0.683509  1.978757

In [22]:
### Using multiple conditions to perform selection 

##Consider the following Series 
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [23]:
df['Y']>1

A    False
B    False
C    False
D    False
E     True
Name: Y, dtype: bool

In [20]:
## Use the & operator. Using 'and' will return an error since it can only take into account single
## instances of boolean values at the time. 

df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [21]:
## We can also use the | operator (or or 'pipe' operator)

df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
###Index 

##Resetting the index or setting it to something else  


##Resetting the index
df.reset_index() ##Previous index is reset as a column, we must specify the inplace = True argument to reset permanently

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [30]:
## Setting the index

new_ind = 'CA NY WY OR CO'.split() ##Trick to create a list ;)

In [31]:
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [32]:
df['States'] = new_ind ##Creates a new column in our dataFrame df

In [33]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [35]:
df.set_index('States') ## Notice that the previous index is overwritten and lost, unlike the .reset_index() method 
                       ## where the previous index was retained as a column

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509